## Importar pandas

In [1]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [2]:
data = pd.read_csv('titanic/train.csv')

## Primeiras Linhas

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Últimas Linhas

In [4]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Informações do DataFrame

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Resumo Estatístico de Campos Numéricos

In [6]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatístico de campos Categóricos

In [7]:
data.describe(include=[object])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## Renomear colunas

In [8]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
data.rename({
    'Name': 'Nome',
    'Sex': 'Sexo',
    'Age': 'Idade',
    'Fare': 'Tarifa',
    'PassengerId': 'IdPassageiro',
    "Survived": "Sobreviveu",
    "Ticket": "Bilhete",
    "Cabin": "Cabine",
    "Embarked": "Embarque",
    "Pclass": "Classe",
    "SibSp": "IrmConjuge",
    "Parch": "PaisFilhos"
}, axis=1, inplace=False).head()

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data.columns
# data.columns = ['IdPassageiro', "Sobreviveu", "Classe", 'Nome', 'Sexo', 'Idade', "IrmConjuge", "PaisFilhos", "Bilhete", 'Tarifa',  "Cabine", "Embarque",  ]
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Selecionar Colunas Específicas

In [11]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
data[['Name', 'Sex', 'Pclass', 'Age', 'Survived']].head()

,Name,Sex,Pclass,Age,Survived
0,"Braund, Mr. Owen Harris",male,3,22.0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,38.0,1
2,"Heikkinen, Miss. Laina",female,3,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,35.0,1
4,"Allen, Mr. William Henry",male,3,35.0,0

## Selecionando apenas uma coluna - Data Series

In [13]:
data['Sex'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [14]:
data['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

## Funções matemáticas embutidas

In [15]:
data['Age'].mean()

29.69911764705882

In [16]:
data['Age'].sum()

21205.17

In [17]:
data['Age'].count()

714

In [18]:
data['Age'].median()

28.0

In [19]:
data['Age'].mode()

0    24.0
Name: Age, dtype: float64

In [20]:
data['Age'].max()

80.0

In [21]:
data['Age'].min()

0.42

In [22]:
data['Age'].idxmin()

803

In [23]:
data['Age'].idxmax()

630

In [24]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
sub_data = data[['Age', 'Fare', 'SibSp', 'Parch']]
sub_data.head()

    Age     Fare  SibSp  Parch
0  22.0   7.2500      1      0
1  38.0  71.2833      1      0
2  26.0   7.9250      0      0
3  35.0  53.1000      1      0
4  35.0   8.0500      0      0

In [26]:
sub_data.mean()

Age      29.699118
Fare     32.204208
SibSp     0.523008
Parch     0.381594
dtype: float64

In [27]:
sub_data.sum()

Age      21205.1700
Fare     28693.9493
SibSp      466.0000
Parch      340.0000
dtype: float64

In [28]:
sub_data.median()

Age      28.0000
Fare     14.4542
SibSp     0.0000
Parch     0.0000
dtype: float64

In [29]:
sub_data.min()

Age      0.42
Fare     0.00
SibSp    0.00
Parch    0.00
dtype: float64

In [30]:
sub_data.max()

Age       80.0000
Fare     512.3292
SibSp      8.0000
Parch      6.0000
dtype: float64

In [31]:
sub_data.std()

Age      14.526497
Fare     49.693429
SibSp     1.102743
Parch     0.806057
dtype: float64

## Selecionando pelo Index - iloc

In [32]:
data.iloc[630]

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

In [33]:
data.iloc[803]

PassengerId                                804
Survived                                     1
Pclass                                       3
Name           Thomas, Master. Assad Alexander
Sex                                       male
Age                                       0.42
SibSp                                        0
Parch                                        1
Ticket                                    2625
Fare                                    8.5167
Cabin                                      NaN
Embarked                                     C
Name: 803, dtype: object

In [34]:
data.iloc[[803]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

In [35]:

data.iloc[[630]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [36]:
data.iloc[[630, 803, 80, 55]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
80,81,0,3,"Waelens, Mr. Achille",male,22.00,0,0,345767,9.0000,NaN,S
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S

In [37]:
data.iloc[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [38]:
data.iloc[1:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [39]:
data.iloc[885:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [40]:
data.iloc[[-1]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [41]:
data['Pclass'].iloc[2]

3

In [42]:
data['Name'].iloc[2]

'Heikkinen, Miss. Laina'

## Operador de seleção "loc"

In [43]:
data[['Age', 'Sex', 'Fare', 'Pclass', 'Survived']
     ].loc[data['Sex'] == 'male'].head()

    Age   Sex     Fare  Pclass  Survived
0  22.0  male   7.2500       3         0
4  35.0  male   8.0500       3         0
5   NaN  male   8.4583       3         0
6  54.0  male  51.8625       1         0
7   2.0  male  21.0750       3         0

In [44]:
data[['Age', 'Sex', 'Fare', 'Pclass', 'Survived']
     ].loc[data['Sex'] == 'female'].head()

    Age     Sex     Fare  Pclass  Survived
1  38.0  female  71.2833       1         1
2  26.0  female   7.9250       3         1
3  35.0  female  53.1000       1         1
8  27.0  female  11.1333       3         1
9  14.0  female  30.0708       2         1

## Selecionando com múltiplas condições

In [45]:
data[['Age', 'Sex', 'Fare', 'Pclass', 'Survived']].loc[(
    data['Age'] >= 3) & (data['Age'] <= 10)].head()

    Age     Sex     Fare  Pclass  Survived
10  4.0  female  16.7000       3         1
24  8.0  female  21.0750       3         0
43  3.0  female  41.5792       2         1
50  7.0    male  39.6875       3         0
58  5.0  female  27.7500       2         1

In [46]:
data[['Age', 'Sex', 'Fare', 'Pclass', 'Survived']].loc[
    (data['Age'] > 14) & (data['Survived'] == True)].head()

     Age     Sex     Fare  Pclass  Survived
1   38.0  female  71.2833       1         1
2   26.0  female   7.9250       3         1
3   35.0  female  53.1000       1         1
8   27.0  female  11.1333       3         1
11  58.0  female  26.5500       1         1

In [47]:
data[['Age', 'Fare', 'Pclass', 'Survived']].loc[
    (data['Age'] > 14) & (data['Survived'] == True)].mean()

Age         32.638776
Fare        55.771022
Pclass       1.775510
Survived     1.000000
dtype: float64

In [48]:
data[['Survived']].loc[
    (data['Age'] > 14) & (data['Survived'] == True)].count()

Survived    245
dtype: int64

In [49]:
data[['Age', 'Fare', 'Pclass']].loc[
    (data['Age'] > 14) & (data['Survived'] == True)].sum()

Age        7996.5000
Fare      13663.9003
Pclass      435.0000
dtype: float64

## map e replace

In [50]:
data['Sex'].map({
    'male': 'homem',
    'female': 'mulher'
}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sex, dtype: object

In [51]:
data['Sex'].replace({
    'male': 'homem',
    'female': 'mulher'
}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sex, dtype: object

In [52]:
data['Sex'].replace(['male', 'female'], ['homem', 'mulher']).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sex, dtype: object

In [53]:
data['Sex'].replace(['male', 'female'], 'person').head()

0    person
1    person
2    person
3    person
4    person
Name: Sex, dtype: object

## Groupby - Agrupar por

In [54]:
data.groupby('Sex').sum()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,135343,233,678,"Cumings, Mrs. John Bradley (Florence Briggs Th...",7286.00,218,204,PC 17599STON/O2. 3101282113803347742237736PP 9...,13966.6628,C85C123G6C103B78D33B28F33C23 C25 C27E101F E69D...,CSSSCSSSSSCQSSQCQSCSSCQQSCSSSSSSSQSSSSSSQCSCSS...
male,262043,109,1379,"Braund, Mr. Owen HarrisAllen, Mr. William Henr...",13919.17,248,136,A/5 2117137345033087717463349909A/5. 215134708...,14727.2865,E46D56A6C23 C25 C27B30C52C83F G73E31A5D10 D12D...,SSQSSSSQSSSSCSSCSCSCSCSQCSSCSCSCSSCCSSSSCSSSSS...

In [55]:
data.groupby('Sex').count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [72]:
data.groupby('Sex').mean(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [74]:
data.groupby('Survived').mean(numeric_only=True)

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [76]:
data.groupby('Pclass').mean(numeric_only=True)

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [77]:
data.groupby(['Sex', 'Pclass']).mean(numeric_only=True)

               PassengerId  Survived        Age     SibSp     Parch  \
Sex    Pclass
female 1        469.212766  0.968085  34.611765  0.553191  0.457447
       2        443.105263  0.921053  28.722973  0.486842  0.605263
       3        399.729167  0.500000  21.750000  0.895833  0.798611
male   1        455.729508  0.368852  41.281386  0.311475  0.278689
       2        447.962963  0.157407  30.740707  0.342593  0.222222
       3        455.515850  0.135447  26.507589  0.498559  0.224784

                     Fare
Sex    Pclass
female 1       106.125798
       2        21.970121
       3        16.118810
male   1        67.226127
       2        19.741782
       3        12.661633

## Crosstab

In [79]:
pd.crosstab(data['Survived'], data['Pclass'])

Pclass      1   2    3
Survived
0          80  97  372
1         136  87  119

In [80]:
pd.crosstab(data['Survived'], data['Pclass'], margins=True)

Pclass      1    2    3  All
Survived
0          80   97  372  549
1         136   87  119  342
All       216  184  491  891

In [84]:
pd.crosstab(data['Survived'], data['Sex'],
            margins=True).style.background_gradient(cmap='OrRd')

In [83]:
pd.crosstab(data['Survived'], data['Sex'],
            margins=True).style.background_gradient(cmap='Blues')

## Ordenando Dados

In [87]:
data[['Age', 'Sex', 'Pclass', 'Survived']].sort_values('Pclass').head(10)

       Age     Sex  Pclass  Survived
445   4.00    male       1         1
310  24.00  female       1         1
309  30.00  female       1         1
307  17.00  female       1         1
306    NaN  female       1         1
305   0.92    male       1         1
710  24.00  female       1         1
711    NaN    male       1         0
311  18.00  female       1         1
712  48.00    male       1         1

In [88]:
data[['Age', 'Sex', 'Pclass', 'Survived']].sort_values(
    'Pclass', ascending=False).head(10)

      Age     Sex  Pclass  Survived
0    22.0    male       3         0
511   NaN    male       3         0
500  17.0    male       3         0
501  21.0  female       3         0
502   NaN  female       3         0
503  37.0  female       3         0
508  28.0    male       3         0
509  26.0    male       3         1
510  29.0    male       3         1
514  24.0    male       3         0

In [90]:
data[['Age', 'Sex', 'Pclass', 'Survived']].sort_values('Age').head(10)

      Age     Sex  Pclass  Survived
803  0.42    male       3         1
755  0.67    male       2         1
644  0.75  female       3         1
469  0.75  female       3         1
78   0.83    male       2         1
831  0.83    male       2         1
305  0.92    male       1         1
827  1.00    male       2         1
381  1.00  female       3         1
164  1.00    male       3         0

In [91]:
data[['Age', 'Sex', 'Pclass', 'Survived']].sort_index().head(10)

    Age     Sex  Pclass  Survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0
5   NaN    male       3         0
6  54.0    male       1         0
7   2.0    male       3         0
8  27.0  female       3         1
9  14.0  female       2         1

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

## Deletando Coluna ou Linha

## Apply e Lambda

## Variáveis Dummy | HotEncoder

## Concatenando DataFrames

# Expressões Regulares

. - qualquer caracter
<br>\d - dígitos (0-9)
<br>\D - exceto dígitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaço em branco (tab, espaço, nova linha)
<br>\S - qualquer coisa exceto espaço em branco (tab, espaço, nova linha)
<br>\b - início de uma palavra
<br>\B - exceto início da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres não em colchetes
<br>| - ou
<br>( ) - grupo

<br>\* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - número exato
<br>{3,4} - range de Números (mínimo, máximo)

Referência (inglês):
http://bit.ly/ExpressoesRegulares

# Engenharia de Recursos - Feature Engineering

## Mudando Valores Linha Por Linha - iterrows()